IDEA StatiCa Open Model
SetupValueDouble Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Setup value double
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.SetupValue
 IdeaRS.OpenModel.Concrete.SetupValueDouble
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class SetupValueDouble : SetupValue
Public Class SetupValueDouble
	Inherits SetupValue
public ref class SetupValueDouble : public SetupValue
The SetupValueDouble type exposes the following members.
Constructors
Name | Description
SetupValueDouble
Initializes a new instance of the SetupValueDouble class
Top
Properties
Name | Description
Id
 Gets or sets the value id.
 (Inherited from SetupValue.)
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace